Autodesk.Revit.DB.Structure.IAnalyticalAutomationCallback.GetToleranceParams(Autodesk.Revit.DB.Document)
Returns tolerance params for all types of tolerance type.
doc:
Revit document.
Since:
2026.1

Autodesk.Revit.DB.Structure.IAnalyticalAutomationCallback.RunPhysicalToAnalyticalScript(Autodesk.Revit.DB.Document,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId},System.Double,System.Double,System.Double,System.Double)
Runs the Physical to Analytical script.
Returns true on success, false otherwise.
doc:
Revit document.
selectedElements:
Elements for which to generate the Analytical Elements.
inPlanTolerance:
Tolerance for In-plan Alignment.
columnsAndWallsTolerance:
Tolerance for Columns and Calls Alignment.
floorsTolerance:
Tolerance for Floors Alignment.
beamsTolerance:
Tolerance for Beams Alignment.
Since:
2026.1